package String;


//游戏队友搜索
//问题描述
//在一款多人游戏中，每局比赛需要多个玩家参与。如果发现两名玩家至少一起玩过两局比赛，则可以认为这两名玩家互为队友。现在你有一份玩家（通过玩家ID标识）和比赛局次（通过比赛ID标识）的历史记录表，目标是帮助某位指定玩家找到所有符合条件的队友。
//
//例如，已知以下比赛历史记录：
//
//| 玩家ID | 游戏ID |
//测试样例
//样例1：
//
//输入：id = 1, num = 10, array = [[1,1], [1,2], [1,3], [2,1], [2,4], [3,2], [4,1], [4,2], [5,2], [5,3]]
//输出：[4, 5]
//
//样例2：
//
//输入：id = 2, num = 6, array = [[2,1], [2,3], [1,1], [1,2], [3,1], [4,3]]
//输出：[]
//
//样例3：
//
//输入：id = 3, num = 8, array = [[3,1], [3,2], [3,3], [4,1], [5,2], [6,3], [7,1], [7,2]]
//输出：[7]
public class MarsCode2 {
}
